---
kind: property
id: P:Autodesk.Revit.DB.UnitTypeId.CelsiusInterval
source: html/ed815d6d-aa42-f401-2982-f480c7c03a2d.htm
---
# Autodesk.Revit.DB.UnitTypeId.CelsiusInterval Property

Celsius interval.

## Syntax (C#)
```csharp
public static ForgeTypeId CelsiusInterval { get; }
```